public class Main {
    public static void main(String[] args) {
        // Номер телефона
        // функция умножения
        // Метод цепочек
        // Реализовать алгоритмы поиска, вставки, удаления элементов таблицы и распечатки таблицы и метод ре-хэширования таблицы при увеличении размера данных
        System.out.println("Hello world!");
    }
}